In [371]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

# DATA LOADING

In [372]:
data_train=pd.read_csv('train.csv')
data_test=pd.read_csv('test.csv')

In [373]:
data_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [374]:
data_train.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [375]:
data_train.shape

(891, 12)

In [376]:
data_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [377]:
data_test.shape

(418, 11)

In [378]:
data_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# IMPUTING MISSING VALUES IN TRAIN DATASET

In [379]:
#AGE VARIABLE
data_train['Age'].mode()

0    24.0
dtype: float64

In [380]:
data_train['Age']=data_train['Age'].fillna('24.0')

In [381]:
data_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [382]:
data_train['Ticket'].value_counts()

1601        7
CA. 2343    7
347082      7
CA 2144     6
347088      6
           ..
364846      1
236171      1
349243      1
394140      1
229236      1
Name: Ticket, Length: 681, dtype: int64

In [383]:
data_train['Embarked'].mode()

0    S
dtype: object

In [384]:
#EMBARKED VARIABLE
data_train['Embarked']=data_train['Embarked'].fillna('S')

In [385]:
#DROPPING TICKET VARIABLE
data_train=data_train.drop(['Ticket'],axis=1)

In [386]:
data_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [387]:
#DROPPING CABIN VARIABLE
data_train=data_train.drop(['Cabin'],axis=1)

In [388]:
#DROPPING NAME VARIABLE
data_train=data_train.drop(['Name'],axis=1)

In [389]:
data_train.head()

   PassengerId  Survived  Pclass     Sex Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22      1      0   7.2500        S
1            2         1       1  female  38      1      0  71.2833        C
2            3         1       3  female  26      0      0   7.9250        S
3            4         1       1  female  35      1      0  53.1000        S
4            5         0       3    male  35      0      0   8.0500        S

In [390]:
data_train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [391]:
data_train.describe()

       PassengerId    Survived      Pclass       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000    8.000000    6.000000  512.329200

In [392]:
data_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Fare', 'Embarked'],
      dtype='object')

In [393]:
data_train['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [394]:
#PERFORMING ONE HOT ENCODING ON CATEGORICAL VARIABLES

In [395]:
final_train_data=pd.get_dummies(data_train,columns=['Pclass','Embarked','Sex'])

In [396]:
final_train_data.columns

Index(['PassengerId', 'Survived', 'Age', 'SibSp', 'Parch', 'Fare', 'Pclass_1',
       'Pclass_2', 'Pclass_3', 'Embarked_C', 'Embarked_Q', 'Embarked_S',
       'Sex_female', 'Sex_male'],
      dtype='object')

In [397]:
#test data
data_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [398]:
data_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

# IMPUTING MISSING VALUES IN TEST DATASET

In [399]:
data_test=data_test.drop(['Cabin'],axis=1)

In [400]:
data_test=data_test.drop(['Ticket'],axis=1)

In [401]:
data_test.shape

(418, 9)

In [402]:
data_test['Age'].mode()

0    21.0
1    24.0
dtype: float64

In [403]:
data_test['Age']=data_test['Age'].fillna('24.0')

In [404]:
data_test=data_test.drop(['Name'],axis=1)

In [405]:
data_test.isnull().sum()

PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           1
Embarked       0
dtype: int64

In [406]:
data_test['Fare'].mean()

35.6271884892086

In [407]:
data_test['Fare']=data_test['Fare'].fillna('35.62')

In [408]:
final_test_data=pd.get_dummies(data_test,columns=['Pclass','Embarked','Sex'])

In [409]:
final_test_data.head()

,PassengerId,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male
0,892,34.5,0,0,7.8292,0,0,1,0,1,0,0,1
1,893,47,1,0,7,0,0,1,0,0,1,1,0
2,894,62,0,0,9.6875,0,1,0,0,1,0,0,1
3,895,27,0,0,8.6625,0,0,1,0,0,1,0,1
4,896,22,1,1,12.2875,0,0,1,0,0,1,1,0

#SEPERATING DEPENDENT AND INDEPENDENT VARIABLES FROM TRAIN DATASET

In [410]:
x_train=final_train_data.drop(['Survived'],axis=1)

In [411]:
y_train=final_train_data['Survived']

In [412]:
y_train.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [413]:
x_train.head()

,PassengerId,Age,SibSp,Parch,Fare,Pclass_1,Pclass_2,Pclass_3,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male
0,1,22,1,0,7.2500,0,0,1,0,0,1,0,1
1,2,38,1,0,71.2833,1,0,0,1,0,0,1,0
2,3,26,0,0,7.9250,0,0,1,0,0,1,1,0
3,4,35,1,0,53.1000,1,0,0,0,0,1,1,0
4,5,35,0,0,8.0500,0,0,1,0,0,1,0,1

In [414]:
y_train.shape

(891,)

# MODEL BUILDING

In [415]:
from sklearn.linear_model import LogisticRegression
model=LogisticRegression()
model.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [416]:
from sklearn.tree import DecisionTreeClassifier
model_tree=DecisionTreeClassifier()
model_tree.fit(x_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

HYPERPARAMETER TUNING

In [417]:
# Number of features to consider at every split
max_features = ['auto', 'sqrt','log2']
# Maximum number of levels in tree
max_depth = [int(x) for x in np.linspace(5, 1000,1)]
# Minimum number of samples required to split a node
min_samples_split = [int(x) for x in np.linspace(2, 100,1)]
# Minimum number of samples required at each leaf node
min_samples_leaf = [int(x) for x in np.linspace(2, 100,1)]
# Create the random grid
random_grid = {'max_features': max_features,
               'max_depth': max_depth,
               'min_samples_split': min_samples_split,
               'min_samples_leaf': min_samples_leaf,
              'criterion':['gini','entropy']}
from sklearn.model_selection import GridSearchCV
classifier=GridSearchCV(model_tree,random_grid,cv=10)
classifier.fit(x_train,y_train)

GridSearchCV(cv=10, error_score=nan,
             estimator=DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None,
                                              criterion='gini', max_depth=None,
                                              max_features=None,
                                              max_leaf_nodes=None,
                                              min_impurity_decrease=0.0,
                                              min_impurity_split=None,
                                              min_samples_leaf=1,
                                              min_samples_split=2,
                                              min_weight_fraction_leaf=0.0,
                                              presort='deprecated',
                                              random_state=None,
                                              splitter='best'),
             iid='deprecated', n_jobs=None,
             param_grid={'criterion': ['gini', 'entropy'], 'max_depth': [5],
                         'max_features': ['auto', 'sqrt', 'log2'],
                         'min_samples_leaf': [2], 'min_samples_split': [2]},
             pre_dispatch='2*n_jobs', refit=True, return_train_score=False,
             scoring=None, verbose=0)

In [418]:
classifier.best_params_

{'criterion': 'entropy',
 'max_depth': 5,
 'max_features': 'log2',
 'min_samples_leaf': 2,
 'min_samples_split': 2}

In [419]:
classifier.best_score_

0.8047191011235956

In [420]:
#PREDICTING ON THE TEST DATA
prediction=classifier.predict(final_test_data)

In [421]:
pred=pd.DataFrame(prediction)
sub_df=pd.read_csv('gender_submission.csv')
final=pd.concat([sub_df['PassengerId'],pred],axis=1)
final.columns=['PassengerId','Survived']
final.to_csv('sample_submission.csv',index=False)

In [422]:
#importing pickle
import pickle
file=open('kaggle_titanic_model.pkl','wb')
pickle.dump(classifier,file)